Repository: imgly/IMGLYUI-swift
Catalog: Sources/IMGLYCoreUI/IMGLYEngine.xcstrings
Source language: en
Languages: de

# ly_img_engine_error_asset_cannot_apply_color_no_target
source: The selected element has no fill, stroke, or text color to apply this color to.
de: Das ausgewählte Element hat keine Füllung, Kontur oder Textfarbe, auf die diese Farbe angewendet werden könnte.

# ly_img_engine_error_asset_color_cmyk_missing_fields
source: This color asset is incomplete and couldn't be applied.
de: Dieses Farb-Asset ist unvollständig und konnte nicht angewendet werden.

# ly_img_engine_error_asset_color_missing_color_space
source: This color asset is incomplete and couldn't be applied.
de: Dieses Farb-Asset ist unvollständig und konnte nicht angewendet werden.

# ly_img_engine_error_asset_color_spot_missing_fields
source: This color asset is incomplete and couldn't be applied.
de: Dieses Farb-Asset ist unvollständig und konnte nicht angewendet werden.

# ly_img_engine_error_asset_color_spot_representation_invalid
source: This color asset is incomplete and couldn't be applied.
de: Dieses Farb-Asset ist unvollständig und konnte nicht angewendet werden.

# ly_img_engine_error_asset_color_srgb_missing_fields
source: This color asset is incomplete and couldn't be applied.
de: Dieses Farb-Asset ist unvollständig und konnte nicht angewendet werden.

# ly_img_engine_error_asset_resource_data_not_available
source: This asset's file couldn't be loaded. Please try again or use a different asset.
de: Die Datei dieses Assets konnte nicht geladen werden. Bitte versuchen Sie es erneut oder verwenden Sie ein anderes Asset.

# ly_img_engine_error_asset_resource_not_found_at_uri
source: This asset's file couldn't be found. It may have been moved or removed.
de: Die Datei dieses Assets wurde nicht gefunden. Sie wurde möglicherweise verschoben oder entfernt.

# ly_img_engine_error_asset_resource_not_ready_at_uri
source: This asset is still loading. Please wait a moment and try again.
de: Dieses Asset wird noch geladen. Bitte warten Sie einen Moment und versuchen Sie es erneut.

# ly_img_engine_error_asset_transform_preset_fixed_aspect_missing_fields
source: This size preset is incomplete and couldn't be applied.
de: Diese Größenvorgabe ist unvollständig und konnte nicht angewendet werden.

# ly_img_engine_error_asset_transform_preset_fixed_size_missing_fields
source: This size preset is incomplete and couldn't be applied.
de: Diese Größenvorgabe ist unvollständig und konnte nicht angewendet werden.

# ly_img_engine_error_asset_transform_preset_missing_type
source: This size preset is incomplete and couldn't be applied.
de: Diese Größenvorgabe ist unvollständig und konnte nicht angewendet werden.

# ly_img_engine_error_asset_unsupported_mime_type_for_block
source: This file type isn't supported and couldn't be added.
de: Dieser Dateityp wird nicht unterstützt und konnte nicht hinzugefügt werden.

# ly_img_engine_error_asset_uri_meta_missing
source: This asset is missing its file reference, so it couldn't be applied.
de: Diesem Asset fehlt die Dateireferenz, daher konnte es nicht angewendet werden.

# ly_img_engine_error_editor_crop_element_not_croppable
source: This element can't be cropped. Try selecting an image or shape instead.
de: Dieses Element kann nicht zugeschnitten werden. Versuchen Sie stattdessen, ein Bild oder eine Form auszuwählen.

# ly_img_engine_error_editor_crop_no_selected_element
source: Select an element first to start cropping.
de: Wählen Sie zuerst ein Element aus, um mit dem Zuschneiden zu beginnen.

# ly_img_engine_error_editor_no_scene_available
source: There's no design open yet. Create or open one to continue.
de: Es ist noch kein Design geöffnet. Erstellen oder öffnen Sie eines, um fortzufahren.

# ly_img_engine_error_editor_scene_content_empty
source: This design file is empty and couldn't be opened.
de: Diese Design-Datei ist leer und konnte nicht geöffnet werden.

# ly_img_engine_error_editor_scene_decompress_failed
source: This design file couldn't be read. It may be corrupted or incomplete.
de: Diese Design-Datei konnte nicht gelesen werden. Sie ist möglicherweise beschädigt oder unvollständig.

# ly_img_engine_error_editor_scene_entity_invalid
source: The design couldn't be loaded correctly. Please try opening it again.
de: Das Design konnte nicht korrekt geladen werden. Bitte versuchen Sie erneut, es zu öffnen.

# ly_img_engine_error_editor_scene_input_invalid
source: This file isn't a valid design and couldn't be opened. It may be corrupted or created with an incompatible version.
de: Diese Datei ist kein gültiges Design und konnte nicht geöffnet werden. Sie ist möglicherweise beschädigt oder wurde mit einer inkompatiblen Version erstellt.

# ly_img_engine_error_editor_scene_missing_required_key
source: This design file is missing required data and couldn't be opened. It may be corrupted or incomplete.
de: Dieser Design-Datei fehlen erforderliche Daten und sie konnte nicht geöffnet werden. Sie ist möglicherweise beschädigt oder unvollständig.

# ly_img_engine_error_editor_scene_requires_url_load
source: This design is part of an archive and must be opened from its original location.
de: Dieses Design ist Teil eines Archivs und muss von seinem ursprünglichen Speicherort geöffnet werden.

# ly_img_engine_error_editor_scene_size_unavailable
source: The design is still preparing its layout. Please wait a moment and try again.
de: Das Design bereitet noch sein Layout vor. Bitte warten Sie einen Moment und versuchen Sie es erneut.

# ly_img_engine_error_editor_unsupported_serialization_format
source: This design was saved in a format that isn't supported. It may have been created with a newer version.
de: Dieses Design wurde in einem nicht unterstützten Format gespeichert. Es wurde möglicherweise mit einer neueren Version erstellt.

# ly_img_engine_error_encode_cancelled_by_block_error
source: An element in your design couldn't be exported. Please review your design and try again.
de: Ein Element in Ihrem Design konnte nicht exportiert werden. Bitte überprüfen Sie Ihr Design und versuchen Sie es erneut.

# ly_img_engine_error_encode_export_failed
source: Something went wrong while exporting. Please try again.
de: Beim Exportieren ist etwas schiefgelaufen. Bitte versuchen Sie es erneut.

# ly_img_engine_error_encode_gpu_lost_generic
source: Your device ran out of graphics resources during export. Try exporting at a lower resolution.
de: Ihrem Gerät sind während des Exports die Grafikressourcen ausgegangen. Versuchen Sie, mit einer niedrigeren Auflösung zu exportieren.

# ly_img_engine_error_encode_gpu_lost_pdf
source: Your device ran out of graphics resources while exporting the PDF. Your design may contain elements that exceed your device's capabilities.
de: Ihrem Gerät sind beim PDF-Export die Grafikressourcen ausgegangen. Ihr Design enthält möglicherweise Elemente, die die Fähigkeiten Ihres Geräts übersteigen.

# ly_img_engine_error_encode_gpu_lost_svg
source: Your device ran out of graphics resources while exporting. Try reducing the size of large images in your design.
de: Ihrem Gerät sind während des Exports die Grafikressourcen ausgegangen. Versuchen Sie, die Größe großer Bilder in Ihrem Design zu reduzieren.

# ly_img_engine_error_encode_insufficient_resources
source: Your device doesn't have enough resources to export. Try exporting at a lower resolution.
de: Ihr Gerät verfügt nicht über genügend Ressourcen für den Export. Versuchen Sie, mit einer niedrigeren Auflösung zu exportieren.

# ly_img_engine_error_encode_not_all_resources_loaded
source: Some content in your design hadn't finished loading. Please wait for everything to load, then try again.
de: Einige Inhalte Ihres Designs waren noch nicht vollständig geladen. Warten Sie, bis alles geladen ist, und versuchen Sie es erneut.

# ly_img_engine_error_encode_output_size_exceeds_max
source: The export size of {{width}}x{{height}} px is larger than this device supports (max {{maxSize}}). Try exporting at a smaller size.
de: Die Exportgröße von {{width}}x{{height}} px ist größer als von diesem Gerät unterstützt (max. {{maxSize}}). Versuchen Sie, mit einer kleineren Größe zu exportieren.

# ly_img_engine_error_encode_output_size_insufficient_resources
source: Couldn't export at {{width}}x{{height}}. Your device doesn't have enough resources. Try a lower resolution.
de: Export mit {{width}}x{{height}} nicht möglich. Ihr Gerät verfügt nicht über genügend Ressourcen. Versuchen Sie eine niedrigere Auflösung.

# ly_img_engine_error_encode_pdf_render_size_exceeds_max
source: The PDF render size of {{width}}x{{height}} px (at {{dpi}} DPI) exceeds what this device supports (max {{maxSize}}). Try lowering the DPI or the export size.
de: Die PDF-Rendergröße von {{width}}x{{height}} px (bei {{dpi}} DPI) übersteigt die von diesem Gerät unterstützte Größe (max. {{maxSize}}). Verringern Sie die DPI oder die Exportgröße.

# ly_img_engine_error_encode_resource_load_failed_with_reason
source: A file in your design couldn't be loaded, so the export was stopped. Check that all assets are available and try again.
de: Eine Datei in Ihrem Design konnte nicht geladen werden, daher wurde der Export abgebrochen. Stellen Sie sicher, dass alle Assets verfügbar sind, und versuchen Sie es erneut.

# ly_img_engine_error_encode_video_frame_failed
source: A video frame couldn't be processed during export. Please try again.
de: Ein Videobild konnte beim Export nicht verarbeitet werden. Bitte versuchen Sie es erneut.

# ly_img_engine_error_fetch_json_fetch_failed
source: This asset couldn't be loaded. Check your connection and try again.
de: Dieses Asset konnte nicht geladen werden. Bitte überprüfen Sie Ihre Verbindung und versuchen Sie es erneut.

# ly_img_engine_error_fetch_resource_data_empty
source: This asset's file appears to be empty and couldn't be loaded.
de: Die Datei dieses Assets scheint leer zu sein und konnte nicht geladen werden.

# ly_img_engine_error_media_image_encode_failed
source: The image couldn't be encoded for export. Please try again, or try a different format.
de: Das Bild konnte für den Export nicht kodiert werden. Bitte versuchen Sie es erneut oder verwenden Sie ein anderes Format.

# ly_img_engine_error_scene_no_pages_for_audio_export
source: This design has no pages to export audio from. Add a page and try again.
de: Dieses Design hat keine Seiten, aus denen Audio exportiert werden kann. Fügen Sie eine Seite hinzu und versuchen Sie es erneut.
